In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                   'key2':['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.693617 -0.046609
1    a  two -0.009117  1.165435
2    b  one -1.334683  0.389857
3    b  two -1.006580  0.203139
4    a  one  1.647307  0.052322

In [2]:
grouped = df['data1'].groupby(by=df['key1'])
grouped

In [3]:
grouped.sum()

key1
a    0.944573
b   -2.341263
Name: data1, dtype: float64

In [4]:
grouped.mean()

key1
a    0.314858
b   -1.170631
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.476845
      two    -0.009117
b     one    -1.334683
      two    -1.006580
Name: data1, dtype: float64

In [6]:
means.unstack()

key2       one       two
key1
a     0.476845 -0.009117
b    -1.334683 -1.006580

In [7]:
states = np.array(['台北','台中','台中','台北','台北'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [8]:
# 使用Series,執行groupby()
df['data1'].groupby([states,years]).mean().unstack()

        2005      2006
台中 -0.009117 -1.334683
台北 -0.850098  1.647307

In [9]:
# 使用DataFrame,執行groupby()
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                   'key2':['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.715304  0.070795
1    a  two -0.312008 -2.793359
2    b  one -0.298096  0.559998
3    b  two  1.741478  1.133369
4    a  one -0.722076 -0.038701

In [11]:
# 產生DataFrame的groupby實體
grouped1 = df.groupby(by='key1')
grouped1

In [12]:
grouped1[['data1','data2']].mean()

         data1     data2
key1
a    -0.916463 -0.920422
b     0.721691  0.846684